# 24ca0238_ミントゥイェン

# 従業員と部署のcsvファイルをpandasで読み込んでから、レコードの件数や欠損値を出力しました。

In [5]:
#1
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
sns.set()

df1= pd.read_csv('従業員.csv')
df2 = pd.read_csv('部署.csv')

emp_df = pd.DataFrame(df1)
dept_df = pd.DataFrame(df2)


emp_df.info()
dept_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPNO     14 non-null     int64
 1   ENAME     14 non-null     object
 2   JOB       14 non-null     object
 3   MGR       13 non-null     float64
 4   HIREDATE  14 non-null     object
 5   SAL       14 non-null     int64
 6   COMM      4 non-null      float64
 7   DEPTNO    14 non-null     int64
dtypes: float64(2), int64(3), object(3)
memory usage: 1.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DEPTNO  4 non-null      int64
 1   DNAME   4 non-null      object
 2   LOC     4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

# 社員(emp_df)からEname,Salを出力しました。

In [6]:
#2
print(emp_df.loc[:,['ENAME', 'SAL']])

     ENAME   SAL
0    SMITH   800
1    ALLEN  1600
2     WARD  1250
3    JONES  2975
4   MARTIN  1250
5    BLAKE  2850
6    CLARK  2450
7    SCOTT  3000
8     KING  5000
9   TURNER  1500
10   ADAMS  1100
11   JAMES   950
12    FORD  3000
13  MILLER  1300

# 社員(emp_df)から二つの社員番号を出力して、確認

In [7]:
#3 
print(emp_df[(emp_df['EMPNO']==7499) | (emp_df['EMPNO']==7876)])

    EMPNO  ENAME       JOB     MGR   HIREDATE   SAL   COMM  DEPTNO
1    7499  ALLEN  SALESMAN  7698.0  1981/2/20  1600  300.0      30
10   7876  ADAMS     CLERK  7788.0  1987/5/23  1100    NaN      20

# 社員(emp_df)と部署(dept_df)を結合(merge)を使用し、その中で、Empno,Ename,Deptno,Dnameを出力

In [4]:
#4
combine = pd.merge(emp_df, dept_df, on = 'DEPTNO', how = 'inner')
combine.loc[:,['EMPNO', 'ENAME', 'DEPTNO', 'DNAME']]

    EMPNO   ENAME  DEPTNO       DNAME
0    7369   SMITH      20    RESEARCH
1    7499   ALLEN      30       SALES
2    7521    WARD      30       SALES
3    7566   JONES      20    RESEARCH
4    7654  MARTIN      30       SALES
5    7698   BLAKE      30       SALES
6    7782   CLARK      10  ACCOUNTING
7    7788   SCOTT      20    RESEARCH
8    7839    KING      10  ACCOUNTING
9    7844  TURNER      30       SALES
10   7876   ADAMS      20    RESEARCH
11   7900   JAMES      30       SALES
12   7902    FORD      20    RESEARCH
13   7934  MILLER      10  ACCOUNTING

# 職種が SALESMAN ではない従業員の名前(ENAME)と職種(JOB)を出力しました。

In [5]:
#5
notSalesMan = emp_df.query('JOB != "SALESMAN"')
notSalesMan.loc[:, ['ENAME', 'JOB']]

     ENAME        JOB
0    SMITH      CLERK
3    JONES    MANAGER
5    BLAKE    MANAGER
6    CLARK    MANAGER
7    SCOTT    ANALYST
8     KING  PRESIDENT
10   ADAMS      CLERK
11   JAMES      CLERK
12    FORD    ANALYST
13  MILLER      CLERK

# 職種が CLERK で、入社日が1981年6月1日以降の従業員の名前、職種、入社日を抽出しました。

In [6]:
#6
oldSalaryMan = emp_df.query('JOB == "CLERK" and HIREDATE >= "1981-06-01"')
oldSalaryMan.loc[:, ['ENAME', 'JOB', 'HIREDATE']]

     ENAME    JOB   HIREDATE
10   ADAMS  CLERK  1987/5/23
11   JAMES  CLERK  1981/12/3
13  MILLER  CLERK  1982/1/23

# 職種が MANAGER または ANALYST の従業員の名前と職種を抽出しました。

In [7]:
#7
gerAnal = emp_df.query('JOB == "MANAGER" or JOB == "ANALYST"')
gerAnal.loc[:, ['ENAME', 'JOB']]

    ENAME      JOB
3   JONES  MANAGER
5   BLAKE  MANAGER
6   CLARK  MANAGER
7   SCOTT  ANALYST
12   FORD  ANALYST

# 職種が CLERK または部署番号(DEPTNO)が10の従業員を抽出し、 DEPTNOとJOB の順で昇順しました。

In [8]:
#8
clk10 = emp_df.query('JOB == "CLERK" or DEPTNO == 10')
clk10[['ENAME', 'JOB', 'DEPTNO']].sort_values(by=['DEPTNO', 'JOB'])

     ENAME        JOB  DEPTNO
13  MILLER      CLERK      10
6    CLARK    MANAGER      10
8     KING  PRESIDENT      10
0    SMITH      CLERK      20
10   ADAMS      CLERK      20
11   JAMES      CLERK      30

# 給与(SAL)が3000以上3100未満の従業員の名前(ENAME)と給与(SAL)を抽出しました。

In [9]:
#9
highSal = emp_df.query('SAL >= 3000 and SAL < 3100')
highSal.loc[:, ['ENAME', 'SAL']]

    ENAME   SAL
7   SCOTT  3000
12   FORD  3000

# 名前が S で始まる従業員を抽出ました。

In [10]:
#10
startS = emp_df[emp_df['ENAME'].str.startswith('S')]
startS[['ENAME']]

   ENAME
0  SMITH
7  SCOTT

# emp_df の SAL 列を更新しました。

In [11]:
#11
ssl = np.ceil(emp_df['SAL'] / 100) * 100

emp_df['SAL'] = ssl.round(-3).astype(int)
print(emp_df)

    EMPNO   ENAME        JOB     MGR    HIREDATE   SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0  1980/12/17  1000     NaN      20
1    7499   ALLEN   SALESMAN  7698.0   1981/2/20  2000   300.0      30
2    7521    WARD   SALESMAN  7698.0   1981/2/22  1000   500.0      30
3    7566   JONES    MANAGER  7839.0    1981/4/2  3000     NaN      20
4    7654  MARTIN   SALESMAN  7698.0   1981/9/28  1000  1400.0      30
5    7698   BLAKE    MANAGER  7839.0    1981/5/1  3000     NaN      30
6    7782   CLARK    MANAGER  7839.0    1981/6/9  2000     NaN      10
7    7788   SCOTT    ANALYST  7566.0   1987/4/19  3000     NaN      20
8    7839    KING  PRESIDENT     NaN  1981/11/17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0    1981/9/8  2000     0.0      30
10   7876   ADAMS      CLERK  7788.0   1987/5/23  1000     NaN      20
11   7900   JAMES      CLERK  7698.0   1981/12/3  1000     NaN      30
12   7902    FORD    ANALYST  7566.0   1981/12/3  3000     NaN      20
13   7934  MILLER      CLERK  7782.0   1982/1/23  1000     NaN      10

# 従業員の給料SALの平均値を計算しました。

In [12]:
#12
avgSal = emp_df['SAL'].mean()
print(f'平均給料 : {avgSal}')

平均給料 : 2071.4285714285716

# COMM列に値が入っている従業員のデータを抽出しました。

In [13]:
#13
noCom = emp_df[emp_df['COMM'].notnull()]
noCom

   EMPNO   ENAME       JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
1   7499   ALLEN  SALESMAN  7698.0  1981/2/20  2000   300.0      30
2   7521    WARD  SALESMAN  7698.0  1981/2/22  1000   500.0      30
4   7654  MARTIN  SALESMAN  7698.0  1981/9/28  1000  1400.0      30
9   7844  TURNER  SALESMAN  7698.0   1981/9/8  2000     0.0      30